VV_cases/V2_thermal/results/study_v2a/runs/005_data_of13_fluid_consistency_short/simulations/Re100_ogrid/openfoam_setup/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10240
(
0.0061005368
0.0063123308
0.0065342489
0.0067667752
0.0070104167
0.0072657048
0.0075331962
0.0078134743
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
-0.183
-0.183
-0.183
-0.183
-0.183
-0.183
-0.183
-0.183
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.183
0.183
0.183
0.183
0.183
0.183
0.183
0.183
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.17728125
0.16584375
0.15440625
0.14296875
0.13153125
0.12009375
0.10865625
0.09721875
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
-0.17728125
-0.16584375
-0.15440625
-0.14296875
-0.13153125
-0.12009375
-0.10865625
-0.09721875
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.0059963864
0.0059819405
0.0059530837
0.0059098854
0.0058524496
0.0057809148
0.0056954532
0.0055962708
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
