VV_cases/V2_thermal/results/study_v2a/runs/005_data_of13_fluid_consistency_short/simulations/Re100_ogrid/openfoam_setup/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10240
(
0.00015052029
0.00015718693
0.00016417225
0.00017149149
0.0001791606
0.00018719631
0.00019561614
0.00020443846
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.17728125
0.16584375
0.15440625
0.14296875
0.13153125
0.12009375
0.10865625
0.09721875
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.00571875
0.01715625
0.02859375
0.04003125
0.05146875
0.06290625
0.07434375
0.08578125
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
0.183
0.183
0.183
0.183
0.183
0.183
0.183
0.183
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
-0.183
-0.183
-0.183
-0.183
-0.183
-0.183
-0.183
-0.183
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.00014720302
0.00044125444
0.00073424284
0.0010254624
0.0013142115
0.0015997946
0.0018815236
0.0021587199
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
