VV_cases/V2_thermal/results/study_v2a/runs/005_data_of13_fluid_consistency_short/simulations/Re100_ogrid/openfoam_setup/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.05;
    }

    "(U|e)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor          yes;
    nOuterCorrectors           2;
    nCorrectors                2;
    nNonOrthogonalCorrectors   1;
    pRefCell                   0;
    pRefValue                  0;
}
